In [5]:
import sqlite3
import pandas as pd
import csv

In [8]:
conn=sqlite3.connect('Data Engineer_ETL Assignment.db')
cursor=conn.cursor()

In [12]:
sql_query="""
SELECT c.customer_id, c.age, i.item_name,COALESCE(SUM(o.quantity),0) AS total_quantity
FROM customers c
LEFT Join sales s ON c.customer_id = s.customer_id
LEFT Join orders o ON s.sales_id = o.sales_id
LEFT Join items i ON o.item_id = i.item_id
WHERE c.age BETWEEN 18 and 35
GROUP BY c.customer_id, i.item_name
HAVING total_quantity > 0
"""
df=pd.read_sql_query(sql_query, conn)

df.head()

   customer_id  age item_name  total_quantity
0            5   18         x               3
1            5   18         y               3
2            5   18         z               4
3            7   30         x              14
4            7   30         y              19

In [13]:

df_grouped = df.groupby(['customer_id','item_name']).sum().reset_index() 

df_filtered = df_grouped[df_grouped['total_quantity'] > 0]

df_filtered['total_quantity'] = df_filtered['total_quantity'].astype(int)

df_filtered.to_csv('Output_pandas.csv',sep=';', index=False)

print(df_filtered)

    customer_id item_name  age  total_quantity
0             5         x   18               3
1             5         y   18               3
2             5         z   18               4
3             7         x   30              14
4             7         y   30              19
..          ...       ...  ...             ...
65           97         y   23               2
66           97         z   23               3
67          100         x   30               1
68          100         y   30               1
69          100         z   30               5

[70 rows x 4 columns]